


// +++ Функция. Громов Алексей. 19.05.2021
//
// Параметры:
//
// Возвращаемое значение:
//
Функция ПолучитьОстаткиПереданныхНаКомиссию(ПараметрыНастройки) Экспорт
	ПараметрыПодключенияERP = Новый Структура("АдресВнешнейИБ, ПользовательВнешнейИБ, ПарольВнешнейИБ",
		ПараметрыНастройки.АдресСервераERP,
		ПараметрыНастройки.ПользовательERP,
		ПараметрыНастройки.ПарольERP);
		
	Соединение  = ПодключениеКВнешнейИБ(ПараметрыПодключенияERP);
	Если Соединение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Соединение не установлено!");
		Возврат Неопределено;
	КонецЕсли;
	
	GUIDСоглашения	= "";
	
	Если Не СоглашениеСКлиентом.Пустая()Тогда
		
		GUIDСоглашения	= СоглашениеСКлиентом.УникальныйИдентификатор();
	Иначе
		//Вот Сдесь  будемполучать массив но как нить в другой раз
		//Мне ведь не нужно только отобранные соглашения мне нужно партии к ним подтянуть
		
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура("ЭтоОстаткиКомиссии,ДатаФормированияОстатков,Соглашение",
			Истина,
			ТекущаяДата(),
			GUIDСоглашения);
	
	//1. Получим ТЗСОстаткамиПоКоличеству 	
		Ответ = Соединение.ОстаткиПереданныхНаКомиссию(Новый ХранилищеЗначения(ПараметрыМетода, Новый СжатиеДанных(9))).Получить();
		
		Возврат Ответ;
КонецФункции



// +++ Функция. Громов Алексей. 19.05.2021
//
// Параметры:
//
// Возвращаемое значение:
//
Функция ПолучитьНаборыДопов(ПараметрыНастройки) Экспорт
	ПараметрыПодключенияERP = Новый Структура("АдресВнешнейИБ, ПользовательВнешнейИБ, ПарольВнешнейИБ",
		ПараметрыНастройки.АдресСервераERP,
		ПараметрыНастройки.ПользовательERP,
		ПараметрыНастройки.ПарольERP);
		
	Соединение  = ПодключениеКВнешнейИБ(ПараметрыПодключенияERP);
	Если Соединение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Соединение не установлено!");
		Возврат Неопределено;
	КонецЕсли;
	
			Ответ = Соединение.ПолучитьДанныеНаборов().Получить();
		
		Возврат Ответ;
КонецФункции

// +++ Функция. Громов Алексей. 19.05.2021
//
// Параметры:
//
// Возвращаемое значение:
//
Функция ПолучитьОстаткиТоваровПоСкладу(ПараметрыНастройки) Экспорт
	ПараметрыПодключенияERP = Новый Структура("АдресВнешнейИБ, ПользовательВнешнейИБ, ПарольВнешнейИБ",
		ПараметрыНастройки.АдресСервераERP,
		ПараметрыНастройки.ПользовательERP,
		ПараметрыНастройки.ПарольERP);
		
	Соединение  = ПодключениеКВнешнейИБ(ПараметрыПодключенияERP);
	Если Соединение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Соединение не установлено!");
		Возврат Неопределено;
	КонецЕсли;
	
	GUIDСоглашения	= "";
	
	Если Не СоглашениеСКлиентом.Пустая()Тогда
		
		GUIDСоглашения	= СоглашениеСКлиентом.УникальныйИдентификатор();
	Иначе
		//Вот Сдесь  будемполучать массив но как нить в другой раз
		//Мне ведь не нужно только отобранные соглашения мне нужно партии к ним подтянуть
		
	КонецЕсли;
	
	ПараметрыМетода = Новый Структура("ЭтоОстаткиКомиссии,ДатаФормированияОстатков,Соглашение",
			Истина,
			ТекущаяДата(),
			GUIDСоглашения);
	
	//1. Получим ТЗСОстаткамиПоКоличеству 	
		Ответ = Соединение.ОстаткиПереданныхНаКомиссию(Новый ХранилищеЗначения(ПараметрыМетода, Новый СжатиеДанных(9))).Получить();
		
		Возврат Ответ;
КонецФункции



#Область Прочее




////////////////////////////////////////////////////////////////////////////////////////////////
//







//ПодключениеКВнешнейИБ - Функция подключения к серверу с использованием механизмов ADO DB
//Параметры:
//	ПараметрыПодключения - тип Структура("ИмяСервера,ИмяПользователя,Пароль,ИмяБазы,СтрокаПодключения")
//			ИмяСервера			- имя SQL-сервера
//			ИмяПользователя		- Имя пользователя (sa или другой)
//			Пароль				- Пароль пользователя
//			ИмяБазы				- Имя базы данных
//			СтрокаПодключения	- (необязательный параметр) можно передать готовую строку подключения, 
//									если пустая тогда подключение по параметрам
Функция ПодключениеКВнешнейИБ(ПараметрыПодключения)
	
	Перем Прокси;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Адрес = ПараметрыПодключения.АдресВнешнейИБ;
	
	Пользователь = ПараметрыПодключения.ПользовательВнешнейИБ;
	Пароль       = ПараметрыПодключения.ПарольВнешнейИБ;
	
	Попытка
		
		Определения = Новый WSОпределения(Адрес, Пользователь, Пароль); 
	
		Прокси = Новый WSПрокси(Определения, "SyncERP", "SyncERP", "SyncERP" + "Soap",,, );
		Прокси.Пользователь	= Пользователь;
		Прокси.Пароль		= Пароль;
	Исключение
	
	КонецПопытки;
	
	Возврат Прокси;
	
КонецФункции // ПодключениеКВнешнейИБ

// +++ Функция.  10.05.2021
//
// Параметры:
//
// Возвращаемое значение:
//
Функция ПодключитьSQL(ПараметрыПодключения) 
	
	СтрокаПодключения = "Driver={SQL Server};Server="+ПараметрыПодключения.ИмяСервераSQL+";Uid="+ПараметрыПодключения.ПользовательSQL+";Pwd="+ПараметрыПодключения.ПарольSQL+";DataBase="+ПараметрыПодключения.ИмяНовойБазыERP+";";
	
	Попытка
		Connection                   = Новый COMОбъект("ADODB.Connection");
		Connection.ConnectionString  = СтрокаПодключения;
		Connection.ConnectionTimeOut = 0;
		Connection.CommandTimeOut    = 0;
	    Connection.Open();	
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
		Возврат Неопределено;
	КонецПопытки;

	Возврат Connection;
	
КонецФункции	





	
	
#КонецОбласти 


